/* 28: Напишите программу которая
принимает на вход число N и выдает 
произведение числе от 1 до N
4 - 24
5 - 120 */

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
